app/views/movies/index.html.erb

SELECT "movies".* FROM "movies" WHERE (released_on <= '2014-08-04 18:00:00.677478') ORDER BY released_on desc
---

<h1><%= pluralize(@movies.size, 'Movie') %></h1>