app/controllers/movies_controller.rb

  def index
  	@movies = Movie.all
---
SELECT "movies".* FROM "movies" WHERE (released_on <= '2014-08-04 18:00:00.677478') ORDER BY released_on desc