app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("comment", "created_at", "movie_id", "name", "stars", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "Was pretty good"], ["created_at", Fri, 22 Aug 2014 18:11:27 UTC +00:00], ["movie_id", 1], ["name", "Miles Better"], ["stars", 3], ["updated_at", Fri, 22 Aug 2014 18:11:27 UTC +00:00]]
---
	def create
		set_movie
		@review = @movie.reviews.new(review_params)
		if @review.save